// 003_MainFunction.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

//	<< 프로그램 >> 이란 일반적으로 실행코드(실행하는 코드)이고, 
//	명령어들의 조합이다
// 
//	<< 프로세스 >> 란 프로그램을 실행하여 메모리상에서 실행되는 작업 단위
//	프로세스는 자력으로 실행될 수 없음
// 
//	Source Code의 묶음은 프로그램이라고 한다.
//	
//	프로그램의 실행과정
//	1. HDD에 있는 프로그램을 Main Memory에 올린다.
//	2. 프로그램은 주소 데이터와 함깨 메모리에서 CPU로 반환된다.
//	3. 명령어 수행을 위해 명령어가 CPU에 의해 해석되어진다.
//

//	Code는 진입점에서 함수가 순서대로 진행이 됨

#include <iostream>


//	main(){}는 프로그램이 실행될 때 가장 먼저 호출되는 함수 

int main()	// 진입점(Entry)
{   // 함수의 시작

	//	코드

	10;

}   // 함수의 끝

// 	main()에 오류가 발생하면 exit 함수를 써서 프로그램을 
//	강제로 종료할 수 있음
